vlm/base/Enums/СтатусыОбработкиОформлениеСДИЗЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиОформлениеСДИЗЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОтказаПогашенияСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОтказаПогашенияСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОтказаПогашенияСДИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОформленияСДИЗВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОформленияСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОформленияСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОформленияСДИЗОжидаетсяДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОформленияСДИЗОшибкаОжидаетсяДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСДИЗОформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСДИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗАннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗОформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииСформированы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииСформированыЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДИЗОформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДИЗОформленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗПриКорректировкеКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗПриКорректировкеОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗПриКорректировкеОформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПогашенияСДИЗПриКорректировкеОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗПриКорректировкеКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗПриКорректировкеОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОформленияСДИЗПриКорректировкеОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗПриКорректировкеАннулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартияАннулирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДИЗПартияАннулирована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/Enums/СтатусыОбработкиОформлениеСДИЗЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтатусыРасходаНовойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Возврат Результат;
	
КонецФункции

Функция СтатусыРезервированияИсходнойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Черновик);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	Результат.Добавить(ФормированиеПартииКПередаче);
	Результат.Добавить(ФормированиеПартииОбрабатывается);
	Результат.Добавить(ФормированиеПартииОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРезервированияВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаИсходнойПартииБезВыделенияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаИсходнойПартииСВыделениемПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаАннулированияОформленияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОформлениеСДИЗПриКорректировкеАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаАннулированияСписанияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаАннулированияОтказаОтПогашенияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОтказПогашенияСДИЗАннулирован);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаОтказаПогашенияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОтказПогашенияСДИЗОформлен);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаАннулированияВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
